Tekla.Structures.Model.Operations.Operation
The Operation class implements Tekla Structures level operations.

Tekla.Structures.Model.Operations.Operation.InitFilterCache
Inits the filtering cache

Tekla.Structures.Model.Operations.Operation.ClearFilterCache
Clears the filtering cache

Tekla.Structures.Model.Operations.Operation.IsNumberingUpToDate(Tekla.Structures.Model.ModelObject)
Checks whether the numbering is up-to-date for an assembly, part, rebar, surface treatment, pour object or break.
InputModelObject: The model object to check. The object must be an assembly, a part, a rebar or an inherited object.
Throws System.ArgumentException: Thrown if the InputModelObject is not of a correct type or if it is not valid.
Returns: True if the numbering information is up-to-date.

Tekla.Structures.Model.Operations.Operation.IsNumberingUpToDateAll
Checks whether the numbering is up-to-date for every assembly, part and rebar on the model.
Remarks:
Using this method is much faster than checking each object individually.
Returns: True if the numbering information is up-to-date.

Tekla.Structures.Model.Operations.Operation.IsNumberingAllowed
Checks whether the numbering is allowed or not in the current configuration.
Returns: True if the numbering is allowed.

Tekla.Structures.Model.Operations.Operation.GetSimilarNumberedObjects(Tekla.Structures.Model.ModelObject)
Gets similar objects based on numbering of given object.
Remarks:
This method works currently only with parts and assemblies.
ObjectToCompare: The object for comparison.
Returns: List of similar objects.

Tekla.Structures.Model.Operations.Operation.CreateReportFromSelected(System.String,System.String,System.String,System.String,System.String)
Creates a report from the selected objects using the given template name and filename.
A template with the name given in the TemplateName parameter must exist in model folder or in the
folder defined with the advanced option XS_TEMPLATE_DIRECTORY.
If a path is not given in the filename, the file is created to the folder defined with the advanced option XS_REPORT_OUTPUT_DIRECTORY.
If the given folder does not exist, the report creation fails.
See Tekla Structures Help for more information about reports.
TemplateName: The name of the report template to be used in report creation. The name must contain more than three characters.
FileName: The name of the created report. The name must contain more than three characters.
Title1: The first title for the created report.
Title2: The second title for the created report.
Title3: The third title for the created report.
Throws System.ArgumentNullException: Thrown when the TemplateName or FileName is null.
Throws System.ArgumentException: Thrown when the TemplateName or FileName is too short.
Returns: True if the report is created.
using Tekla.Structures.Model;
using Tekla.Structures.Model.Operations;
using Tekla.Structures.Geometry3d;
using System.Collections;
public class Example
{
public void Example1()
{
Model Model = new Model();
Beam B = new Beam(new Point(0,0,0), new Point(0,0,6000));
Beam B1 = new Beam(new Point(0,1000,0), new Point(0,1000,6000));
Beam B2 = new Beam(new Point(0,2000,0), new Point(0,2000,6000));
B.Insert();
B1.Insert();
B2.Insert();
ArrayList ObjectsToSelect = new ArrayList();
ObjectsToSelect.Add(B);
ObjectsToSelect.Add(B2);
Model.CommitChanges();
Tekla.Structures.Model.UI.ModelObjectSelector ModelSelector = new Tekla.Structures.Model.UI.ModelObjectSelector();
ModelSelector.Select(ObjectsToSelect);
Operation.CreateReportFromSelected("Assembly_list", "Assembly_list_selected.xsr", "MyTitle", "", "");
Operation.DisplayReport("Assembly_list_selected.xsr");
}
}

Tekla.Structures.Model.Operations.Operation.CreateReport(Tekla.Structures.Model.Operations.Operation.ReportParameters)
Creates a report using the given report parameters.
A template with the name given in the TemplateName parameter must exist in model folder or in the
folder defined with the advanced option XS_TEMPLATE_DIRECTORY.
If a path is not given in the filename, the file is created to the folder defined with the advanced option XS_REPORT_OUTPUT_DIRECTORY.
If the given folder does not exist, the report creation fails.
See Tekla Structures Help for more information about reports.
parameters: The report parameters.
Throws System.ArgumentNullException: Thrown when the parameters.TemplateName.TemplateName or parameters.FileName.FileName is null.
Throws System.ArgumentException: Thrown when the parameters.TemplateName.TemplateName or parameters.FileName.FileName is too short.
Returns: True if the report is created.
using Tekla.Structures.Model;
using Tekla.Structures.Model.Operations;
using Tekla.Structures.Geometry3d;
using System.Collections;
public class Example
{
public void Example1()
{
Model Model = new Model();
Beam B = new Beam(new Point(0,0,0), new Point(0,0,6000));
Beam B1 = new Beam(new Point(0,1000,0), new Point(0,1000,6000));
Beam B2 = new Beam(new Point(0,2000,0), new Point(0,2000,6000));
B.Insert();
B1.Insert();
B2.Insert();
ArrayList ObjectsToSelect = new ArrayList();
ObjectsToSelect.Add(B);
ObjectsToSelect.Add(B2);
Model.CommitChanges();
Tekla.Structures.Model.UI.ModelObjectSelector ModelSelector = new Tekla.Structures.Model.UI.ModelObjectSelector();
ModelSelector.Select(ObjectsToSelect);
Operation.CreateReport(new ReportParameters{
TemplateName = "Assembly_list",
FileName = "Assembly_list_selected.xsr",
Title1 = "MyTitle",
Title2 = "",
Title3 = "",
IsFromSelected = true });
Operation.DisplayReport("Assembly_list_selected.xsr");
}
}

Tekla.Structures.Model.Operations.Operation.DisplayReport(System.String)
Opens and displays a report with the given name.
If a path is not given in the filename, the file is searched from the folder defined with the advanced option XS_REPORT_OUTPUT_DIRECTORY.
See Tekla Structures Help for more information about reports.
FileName: The name of the report to display. The name must contain more than three characters.
Throws System.ArgumentException: Thrown when the file specified in the FileName is not found or
when the FileName is too short.
Returns: True if the report existed.

Tekla.Structures.Model.Operations.Operation.DisplayPrintReportDialog(System.String)
Opens the print dialog for a report with the given filename.
FileName:
Returns:
Throws System.ArgumentException:

Tekla.Structures.Model.Operations.Operation.CreateReportFromAll(System.String,System.String,System.String,System.String,System.String)
Creates a report from all the objects using the given template name and filename.
A template with the name given in the TemplateName parameter must exist in model folder or in the folder defined
with the advanced option XS_TEMPLATE_DIRECTORY.
If a path is not given in the filename, the file is created to the folder defined with the advanced option XS_REPORT_OUTPUT_DIRECTORY.
If the given folder does not exist, the report creation fails.
Internally, this method is asynchronous, and because of that the output file cannot be immediately available.
See Tekla Structures Help for more information about reports.
TemplateName: The name of the report template to be used in report creation. The name must contain more than three characters.
FileName: The name of the created report. The name must contain more than three characters.
Title1: The first title for the created report.
Title2: The second title for the created report.
Title3: The third title for the created report.
Throws System.ArgumentNullException: Thrown when the TemplateName or FileName is null.
Throws System.ArgumentException: Thrown when the TemplateName or FileName is too short.
Returns: True if the report is created.
The following example creates a report and then displays it. It is taken into account that the created file might not be immediately available.
using System.IO;
using System.Threading;
using Tekla.Structures.Model.Operations;
public class Example
{
public bool IfLockedWait(string FileName)
{
// try 10 times
int RetryNumber = 10;
while (true)
{
try
{
using(FileStream FileStream = new FileStream(
FileName, FileMode.Open,
FileAccess.ReadWrite, FileShare.ReadWrite))
{
byte[] ReadText = new byte[FileStream.Length];
FileStream.Seek(0, SeekOrigin.Begin);
FileStream.Read(ReadText, 0, (int)FileStream.Length);
}
return true;
}
catch (IOException)
{
// wait one second
Thread.Sleep(1000);
RetryNumber--;
if(RetryNumber == 0)
return false;
}
}
}
public void Example1()
{
Operation.CreateReportFromAll("Assembly_list", "Assembly_list.xsr", "MyTitle", "", "");
if(File.Exists("Assembly_list.xsr"))
{
// wait until Tekla Structures has unlocked the file, or timeout
if(IfLockedWait("Assembly_list.xsr"))
{
// display the report
Operation.DisplayReport("Assembly_list.xsr");
}
}
}
}

Tekla.Structures.Model.Operations.Operation.CreateNCFilesFromSelected(System.String,System.String)
Creates NC files from the selected parts using the given NC template name.
See Tekla Structures Help for more information about NC files.
NCFileSettings: The name of the NC setting template to be used in creation.
DestinationFolder: The name of the folder where NC files are created. If defined, overrides the default folder in the setting template.
Throws System.ArgumentException: Thrown when the NCFileSettings is not defined.
Throws System.ArgumentNullException: Thrown when the NCFileSettings is null.
Returns: True if the NC files are created, false if the numbering is not up-to-date or the used configuration is wrong.
using Tekla.Structures.Model;
using Tekla.Structures.Model.Operations;
using Tekla.Structures.Model.UI;
using System.Collections;
using System.Windows.Forms;
public class Example
{
public void Example1()
{
Picker Picker = new Picker();
try
{
Beam Beam1 = Picker.PickObject(Picker.PickObjectEnum.PICK_ONE_PART, "Pick object to Create NC for") as Beam;
ArrayList Parts = new ArrayList();
Parts.Add(Beam1);
Tekla.Structures.Model.UI.ModelObjectSelector MOS = new Tekla.Structures.Model.UI.ModelObjectSelector();
MOS.Select(Parts);
if (Operation.CreateNCFilesFromSelected("DSTV for profiles", ""))
MessageBox.Show("NC creation successful");
MOS.Select(new ArrayList()); //remove UI selection
}
catch { }
}
}

Tekla.Structures.Model.Operations.Operation.CreateNCFilesFromSelected(System.String,System.String,System.Boolean,System.String,System.Boolean,System.String)
Creates NC files from the selected parts using the given NC template name.
See Tekla Structures Help for more information about NC files.
NCFileSettings: The name of the NC setting template to be used in creation.
DestinationFolder: The name of the folder where NC files are created. If defined, overrides the default folder in the setting template.
CreatePopMarks: Create pop-marks during export.
PopMarkSettingsFileName: The name of the pop-mark setting file to be used in creation.
CreateContourMarking: Create contour marking during export.
ContourMarkingSettingsFileName: The name of the contour marking setting file to be used in creation.
Throws System.ArgumentException: Thrown when the NCFileSettings is not defined.
Throws System.ArgumentNullException: Thrown when the NCFileSettings is null.
Returns: True if the NC files are created, false if the numbering is not up-to-date or the used configuration is wrong.
using Tekla.Structures.Model;
using Tekla.Structures.Model.Operations;
using Tekla.Structures.Model.UI;
using System.Collections;
using System.Windows.Forms;
public class Example
{
public void Example1()
{
Picker Picker = new Picker();
try
{
Beam Beam1 = Picker.PickObject(Picker.PickObjectEnum.PICK_ONE_PART, "Pick object to Create NC for") as Beam;
ArrayList Parts = new ArrayList();
Parts.Add(Beam1);
Tekla.Structures.Model.UI.ModelObjectSelector MOS = new Tekla.Structures.Model.UI.ModelObjectSelector();
MOS.Select(Parts);
if (Operation.CreateNCFilesFromSelected("DSTV for profiles", "", true, "standard", true, "standard"))
MessageBox.Show("NC creation successful");
MOS.Select(new ArrayList()); //remove UI selection
}
catch { }
}
}

Tekla.Structures.Model.Operations.Operation.CreateNCFilesFromAll(System.String,System.String)
Creates NC files from all parts using the given NC template name.
See Tekla Structures Help for more information about NC files.
NCFileSettings: The name of the NC setting template to be used in creation.
DestinationFolder: The name of the folder where NC files are created. If defined, overrides the default folder in the setting template.
Throws System.ArgumentException: Thrown when the NCFileSettings is not defined.
Throws System.ArgumentNullException: Thrown when the NCFileSettings is null.
Returns: True if the NC files are created, false if the numbering is not up-to-date or the used configuration is wrong.
using Tekla.Structures.Model.Operations;
using System.Windows.Forms;
public class Example
{
public void Example1()
{
if (Operation.CreateNCFilesFromAll("DSTV for plates", ""))
MessageBox.Show("NC creation successful");
}
}

Tekla.Structures.Model.Operations.Operation.CreateNCFilesFromAll(System.String,System.String,System.Boolean,System.String,System.Boolean,System.String)
Creates NC files from all parts using the given NC template name.
See Tekla Structures Help for more information about NC files.
NCFileSettings: The name of the NC setting template to be used in creation.
DestinationFolder: The name of the folder where NC files are created. If defined, overrides the default folder in the setting template.
CreatePopMarks: Create pop-marks during export.
PopMarkSettingsFileName: The name of the pop-mark setting file to be used in creation.
CreateContourMarking: Create contour marking during export.
ContourMarkingSettingsFileName: The name of the contour marking setting file to be used in creation.
Throws System.ArgumentException: Thrown when the NCFileSettings is not defined.
Throws System.ArgumentNullException: Thrown when the NCFileSettings is null.
Returns: True if the NC files are created, false if the numbering is not up-to-date or the used configuration is wrong.
using Tekla.Structures.Model.Operations;
using System.Windows.Forms;
public class Example
{
public void Example1()
{
if (Operation.CreateNCFilesFromAll("DSTV for plates", "", true, "standard", true, "standard"))
MessageBox.Show("NC creation successful");
}
}

Tekla.Structures.Model.Operations.Operation.CreateNCFilesByPartId(System.String,System.String,Tekla.Structures.Identifier,System.String@,System.Boolean,System.String,System.Boolean,System.String)
Creates NC files from the selected parts using the given NC template name.
See Tekla Structures Help for more information about NC files.
NCFileSettings: The name of the NC setting template to be used in creation.
DestinationFolder: The name of the folder where NC files are created. If defined, overrides the default folder in the setting template.
PartID: The identifier of the part.
DstvOutput: The DSTV output as string.
CreatePopMarks: Create pop-marks during export.
PopMarkSettingsFileName: The name of the pop-mark setting file to be used in creation.
CreateContourMarking: Create contour marking during export.
ContourMarkingSettingsFileName: The name of the contour marking setting file to be used in creation.
Throws System.ArgumentException: Thrown when the NCFileSettings is not defined.
Throws System.ArgumentNullException: Thrown when the NCFileSettings is null.
Returns: True if the NC files are created, false if the numbering is not up-to-date or the used configuration is wrong.
using Tekla.Structures.Model;
using Tekla.Structures.Model.Operations;
using Tekla.Structures.Model.UI;
using System.Collections;
using System.Windows.Forms;
public class Example
{
public void Example1()
{
Picker Picker = new Picker();
try
{
Beam Beam1 = Picker.PickObject(Picker.PickObjectEnum.PICK_ONE_PART, "Pick object to Create NC for") as Beam;
Identifier BeamId = Beam1.Identifier;
string DstvOutput;
if (Operation.CreateNCFilesByPartId("DSTV for profiles", "", BeamId, out DstvOutput, true, "standard", true, "standard"))
{
MessageBox.Show("NC creation successful");
//DstvOutput will contain all the info from exported dstv file
}
}
catch { }
}
}

Tekla.Structures.Model.Operations.Operation.CreateMISFileFromSelected(Tekla.Structures.Model.Operations.Operation.MISExportTypeEnum,System.String)
Creates MIS files from the selected parts using the given file name.
See Tekla Structures Help for more information about MIS files.
MISType: The type of the MIS export.
FileName: The name of the MIS file to be used in creation.
Throws System.ArgumentNullException: Thrown when the FileName is null.
Throws System.ArgumentException: Thrown when the FileName is not defined.
Returns: True if the MIS files are created, false if the numbering is not up-to-date or the used configuration is wrong.
using Tekla.Structures.Model;
using Tekla.Structures.Model.Operations;
using Tekla.Structures.Model.UI;
using System.Collections;
using System.Windows.Forms;
public class Example
{
public void Example1()
{
Picker Picker = new Picker();
try
{
Beam Beam1 = Picker.PickObject(Picker.PickObjectEnum.PICK_ONE_PART, "Pick object to Create MIS for") as Beam;
ArrayList Parts = new ArrayList();
Parts.Add(Beam1);
Tekla.Structures.Model.UI.ModelObjectSelector MOS = new Tekla.Structures.Model.UI.ModelObjectSelector();
MOS.Select(Parts);
if (Operation.CreateMISFileFromSelected(Operation.MISExportTypeEnum.STEEL2000, "myExport.st2000"))
MessageBox.Show("MIS creation successful");
MOS.Select(new ArrayList()); //remove UI selection
}
catch { }
}
}

Tekla.Structures.Model.Operations.Operation.CreateMISFileFromAll(Tekla.Structures.Model.Operations.Operation.MISExportTypeEnum,System.String)
Creates MIS files from all parts using the given file name.
See Tekla Structures Help for more information about MIS files.
MISType: The type of the MIS export.
FileName: The name of the MIS file to be used in creation.
Throws System.ArgumentNullException: Thrown when the FileName is null.
Throws System.ArgumentException: Thrown when the FileName is not defined.
Returns: True if the MIS files are created, false if the numbering is not up-to-date or the used configuration is wrong.
using Tekla.Structures.Model.Operations;
using System.Windows.Forms;
public class Example
{
public void Example1()
{
if (Operation.CreateMISFileFromAll(Operation.MISExportTypeEnum.STEEL2000, "myExport.st2000"))
MessageBox.Show("MIS creation successful");
}
}

Tekla.Structures.Model.Operations.Operation.CreateIFC2x3Export(System.String,Tekla.Structures.Model.Operations.Operation.IFC2x3ExportViewTypeEnum,System.Collections.Generic.IEnumerable{System.String},System.String,Tekla.Structures.Model.Operations.Operation.ExportBasePoint,System.Boolean,System.Boolean,Tekla.Structures.Model.Operations.Operation.IFC2x3ExportFlags,System.String)
Creates IFC2x3 export using the given file name.
See Tekla Structures Help for more information about IFC2x3 export files.
fullPathAndFileName: The full path and file name including extension (.ifc, .ifczip or .ifcxml).
exportViewType: The export view type.
attributesOverridesFileNames: The collection of full paths and file names of the attributes overrides files (*_overrideSetData.attributeoverride and *_overrideData.attributeoverride) to use in export. Empty for none.
additionalPropertySetFileName: The full path and file name of the property set file (.xml) to use in export. Empty for none.
locationByValue: The location by value.
layersNamesAsPartNames: True for layers names as part names. False for default.
useViewColors: True for using view colors in export. False for default.
flags: The additional flags.
basePointGuid: Base point guid, if a base point used.
Returns: True, if IFC2x3 export was successful, otherwise false. See log for additional info in case of failure.
using Tekla.Structures.Model;
using Tekla.Structures.Model.Operations;
public class Example
{
public void Example1()
{
Picker Picker = new Picker();
Beam Beam1 = Picker.PickObject(Picker.PickObjectEnum.PICK_ONE_PART, "Pick object to Create an Ifc2x3 for") as Beam;
ArrayList Parts = new ArrayList();
Parts.Add(Beam1);
Tekla.Structures.Model.UI.ModelObjectSelector MOS = new Tekla.Structures.Model.UI.ModelObjectSelector();
MOS.Select(Parts);
var fullPathAndFileName = @"C:\Export\MyIfc.ifc"; // .ifc or .ifcZip
var exportViewType = Operations.Operation.IFC2x3ExportViewTypeEnum.COORDINATION_VIEW_20;
var attributesOverridesFileNames = new new List<string> { @"..\\default\\General\\Shared\\IFC\\IfcAttributeOverrides\\MyOverrides_overrideSetData.attributeoverride", @"..\\default\\General\\Shared\\IFC\\IfcAttributeOverrides\\MyOverrides_overrideData.attributeoverride" };
var additionalPropertySetFileName = @"..\\default\\General\\Shared\\IFC\\AdditionalPSets\\CIP Construction data.xml";
var locationByValue = Operations.Operation.ExportBasePoint.GLOBAL;
bool layersNamesAsPartNames = false;
var useViewColors = false;
var flags = new Operations.Operation.IFC2x3ExportFlags { IsLocationFromOrganizer = true, IsPoursEnabled = true };
var basePointGuid = string.Empty;
if (Operation.CreateIFC2x3Export(
fullPathAndFileName,
exportViewType,
attributesOverridesFileNames,
additionalPropertySetFileName,
locationByValue,
layersNamesAsPartNames,
useViewColors,
flags,
basePointGuid))
{
MessageBox.Show("IFC2x3 export creation successful");
}
else
{
MessageBox.Show("IFC2x3 export creation failed");
}
MOS.Select(new ArrayList()); // Remove UI selection
}
}

Tekla.Structures.Model.Operations.Operation.CreateIFC4ExportFromSelected(System.String,Tekla.Structures.Model.Operations.Operation.IFCExportViewTypeEnum,Tekla.Structures.Model.Operations.Operation.IFCExportVersionEnum,System.Collections.Generic.IEnumerable{System.String},System.Collections.Generic.IEnumerable{System.String},Tekla.Structures.Model.Operations.Operation.ExportBasePoint,System.String,System.String,Tekla.Structures.Model.Operations.Operation.IFCExportFlags,System.String)
Creates IFC4 export from the selected parts only using the given file name.
See Tekla Structures Help for more information about IFC4 export files.
fullPathAndFileName: The full path and file name including extension (.ifc or .ifcZip).
exportViewType: The export view type.
exportVersion: The IFC export version.
attributesOverridesFileNames: The collection of full paths and file names of the attributes overrides files (*_overrideSetData.attributeoverride and *_overrideData.attributeoverride) to use in export. Empty for none.
propertySets: The full path and file name of the property set files (.xml) to use in export.
locationByValue: The location by value.
exportLayersAsValue: The export layers as value: __Name__, __Phase__ or UDA value.
objectColoring: The object coloring value: Use "ByObjectClass" for color by object class. For additional coloring, use the name of the object representation.
flags: The additional flags.
basePointGuid: Base point guid, if a base point used.
Returns: True, if Ifc4 export was successful, otherwise false. See session log for additional info in case failure.
using Tekla.Structures.Model;
using Tekla.Structures.Model.Operations;
public class Example
{
public void Example1()
{
Picker Picker = new Picker();
Beam Beam1 = Picker.PickObject(Picker.PickObjectEnum.PICK_ONE_PART, "Pick object to Create an Ifc4 for") as Beam;
ArrayList Parts = new ArrayList();
Parts.Add(Beam1);
Tekla.Structures.Model.UI.ModelObjectSelector MOS = new Tekla.Structures.Model.UI.ModelObjectSelector();
MOS.Select(Parts);
var fullPathAndFileName = @"C:\Export\MyIfc.ifc";
var exportViewType = Operations.Operation.IFCExportViewTypeEnum.REFERENCE_VIEW;
var exportVersion = Operations.Operation.IFCExportVersionEnum.IFC4;
var attributesOverridesFileNames = new new List<string> { @"..\\default\\General\\Shared\\IFC\\IfcAttributeOverrides\\MyOverrides_overrideSetData.attributeoverride", @"..\\default\\General\\Shared\\IFC\\IfcAttributeOverrides\\MyOverrides_overrideData.attributeoverride" };
var propertySets = new List<string> { @"..\\default\\General\\Shared\\IFC\\AdditionalPSets\\CIP Construction data.xml" };
var locationByValue = Operations.Operation.ExportBasePoint.GLOBAL;
var exportLayersAsValue =  "__Name__";
var objectColoring = "standard";
var flags = new Operations.Operation.IFCExportFlags { IsLocationFromOrganizer = true, IsPoursEnabled = true };
var basePointGuid = string.Empty;
if (Operation.CreateIFC4ExportFromSelected(fullPathAndFileName, exportViewType, attributesOverridesFileNames, propertySets, locationByValue, exportLayersAsValue, objectColoring, flags, basePointGuid))
{
MessageBox.Show("Ifc4 export creation successful");
}
MOS.Select(new ArrayList()); // Remove UI selection
}
}

Tekla.Structures.Model.Operations.Operation.CreateIFC4ExportFromSelectedAndTheirAssemblies(System.String,Tekla.Structures.Model.Operations.Operation.IFCExportViewTypeEnum,Tekla.Structures.Model.Operations.Operation.IFCExportVersionEnum,System.Collections.Generic.IEnumerable{System.String},System.Collections.Generic.IEnumerable{System.String},Tekla.Structures.Model.Operations.Operation.ExportBasePoint,System.String,System.String,Tekla.Structures.Model.Operations.Operation.IFCExportFlags,System.String)
Creates IFC4 export from the selected parts and their assemblies using the given file name.
See Tekla Structures Help for more information about IFC4 export files.
fullPathAndFileName: The full path and file name including extension (.ifc or .ifcZip).
exportViewType: The export view type.
exportVersion: The IFC export version.
attributesOverridesFileNames: The collection of full paths and file names of the attributes overrides files (*_overrideSetData.attributeoverride and *_overrideData.attributeoverride) to use in export. Empty for none.
propertySets: The full path and file name of the property set files (.xml) to use in export.
locationByValue: The location by value.
exportLayersAsValue: The export layers as value: __Name__, __Phase__ or UDA value.
objectColoring: The object coloring value: Use "ByObjectClass" for color by object class. For additional coloring, use the name of the object representation.
flags: The additional flags.
basePointGuid: Base point guid, if a base point used.
Returns: True, if Ifc4 export was successful, otherwise false. See session log for additional info in case failure.
using Tekla.Structures.Model;
using Tekla.Structures.Model.Operations;
public class Example
{
public void Example1()
{
Picker Picker = new Picker();
Beam Beam1 = Picker.PickObject(Picker.PickObjectEnum.PICK_ONE_PART, "Pick object to Create an Ifc4 for") as Beam;
ArrayList Parts = new ArrayList();
Parts.Add(Beam1);
Tekla.Structures.Model.UI.ModelObjectSelector MOS = new Tekla.Structures.Model.UI.ModelObjectSelector();
MOS.Select(Parts);
var fullPathAndFileName = @"C:\Export\MyIfc.ifc";
var exportViewType = Operations.Operation.IFCExportViewTypeEnum.REFERENCE_VIEW;
var exportVersion = Operations.Operation.IFCExportVersionEnum.IFC4;
var attributesOverridesFileNames = new new List<string> { @"..\\default\\General\\Shared\\IFC\\IfcAttributeOverrides\\MyOverrides_overrideSetData.attributeoverride", @"..\\default\\General\\Shared\\IFC\\IfcAttributeOverrides\\MyOverrides_overrideData.attributeoverride" };
var propertySets = new List<string> { @"..\\default\\General\\Shared\\IFC\\AdditionalPSets\\CIP Construction data.xml" };
var locationByValue = Operations.Operation.ExportBasePoint.GLOBAL;
var exportLayersAsValue =  "__Name__";
var objectColoring = "standard";
var flags = new Operations.Operation.IFCExportFlags { IsLocationFromOrganizer = true, IsPoursEnabled = true };
var basePointGuid = string.Empty;
if (Operation.CreateIFC4ExportFromSelected(fullPathAndFileName, exportViewType, attributesOverridesFileNames, propertySets, locationByValue, exportLayersAsValue, objectColoring, flags, basePointGuid))
{
MessageBox.Show("Ifc4 export creation successful");
}
MOS.Select(new ArrayList()); // Remove UI selection
}
}

Tekla.Structures.Model.Operations.Operation.CreateIFC4ExportFromSelected(System.String,Tekla.Structures.Model.Operations.Operation.IFCExportViewTypeEnum,System.Collections.Generic.IEnumerable{System.String},Tekla.Structures.Model.Operations.Operation.ExportBasePoint,System.String,System.String,Tekla.Structures.Model.Operations.Operation.IFCExportFlags,System.String)
Creates IFC4 export from the selected parts using the given file name.
See Tekla Structures Help for more information about IFC4 export files.
fullPathAndFileName: The full path and file name including extension (.ifc or .ifcZip).
exportViewType: The export view type.
propertySets: The full path and file name of the property set files (.xml) to use in export.
locationByValue: The location by value.
exportLayersAsValue: The export layers as value: __Name__, __Phase__ or UDA value.
objectColoring: The object coloring value: Use "ByObjectClass" for color by object class. For additional coloring, use the name of the object representation.
flags: The additional flags.
basePointGuid: Base point guid, if a base point used.
Returns: True, if Ifc4 export was successful, otherwise false. See session log for additional info in case failure.

Tekla.Structures.Model.Operations.Operation.CreateIFC4ExportFromAll(System.String,Tekla.Structures.Model.Operations.Operation.IFCExportViewTypeEnum,Tekla.Structures.Model.Operations.Operation.IFCExportVersionEnum,System.Collections.Generic.IEnumerable{System.String},System.Collections.Generic.IEnumerable{System.String},Tekla.Structures.Model.Operations.Operation.ExportBasePoint,System.String,System.String,Tekla.Structures.Model.Operations.Operation.IFCExportFlags,System.String)
Creates IFC4 export from all objects using the given file name.
See Tekla Structures Help for more information about IFC4 export files.
fullPathAndFileName: The full path and file name including extension (.ifc or .ifcZip).
exportViewType: The export view type.
exportVersion: The IFC export version.
propertySets: The full path and file name of the property set files (.xml) to use in export.
attributesOverridesFileNames: The collection of full paths and file names of the attributes overrides files (*_overrideSetData.attributeoverride and *_overrideData.attributeoverride) to use in export. Empty for none.
locationByValue: The location by value.
exportLayersAsValue: The export layers as value: __Name__, __Phase__ or UDA value.
objectColoring: The object coloring value: Use "ByObjectClass" for color by object class. For additional coloring, use the name of the object representation.
flags: The additional flags.
basePointGuid: Base point guid, if a base point used.
Returns: True, if Ifc4 export was successful, otherwise false. See session log for additional info in case failure.
using Tekla.Structures.Model;
using Tekla.Structures.Model.Operations;
public class Example
{
public void Example1()
{
var fullPathAndFileName = @"C:\Export\MyIfc.ifc";
var exportViewType = Operations.Operation.IFCExportViewTypeEnum.REFERENCE_VIEW;
var exportVersion = Operations.Operation.IFCExportVersionEnum.IFC4;
var propertySets = new List<string> { @"..\\default\\General\\Shared\\IFC\\AdditionalPSets\\CIP Construction data.xml" };
var attributesOverridesFileNames = new new List<string> { @"..\\default\\General\\Shared\\IFC\\IfcAttributeOverrides\\MyOverrides_overrideSetData.attributeoverride", @"..\\default\\General\\Shared\\IFC\\IfcAttributeOverrides\\MyOverrides_overrideData.attributeoverride" };
var locationByValue = Operations.Operation.ExportBasePoint.GLOBAL;
var exportLayersAsValue =  "__Name__";
var objectColoring = "ByObjectClass";
var flags = new Operations.Operation.IFCExportFlags { IsLocationFromOrganizer = true, IsPoursEnabled = true };
var basePointGuid = string.Empty;
if (Operation.CreateIFC4ExportFromAll(fullPathAndFileName, exportViewType, attributesOverridesFileNames, propertySets, locationByValue, exportLayersAsValue, objectColoring, flags, basePointGuid))
{
MessageBox.Show("Ifc4 export creation successful");
}
}
}

Tekla.Structures.Model.Operations.Operation.CreateIFC4ExportFromAll(System.String,Tekla.Structures.Model.Operations.Operation.IFCExportViewTypeEnum,System.Collections.Generic.IEnumerable{System.String},Tekla.Structures.Model.Operations.Operation.ExportBasePoint,System.String,System.String,Tekla.Structures.Model.Operations.Operation.IFCExportFlags,System.String)
Creates IFC4 export from all objects using the given file name.
See Tekla Structures Help for more information about IFC4 export files.
fullPathAndFileName: The full path and file name including extension (.ifc or .ifcZip).
exportViewType: The export view type.
propertySets: The full path and file name of the property set files (.xml) to use in export.
locationByValue: The location by value.
exportLayersAsValue: The export layers as value: __Name__, __Phase__ or UDA value.
objectColoring: The object coloring value: Use "ByObjectClass" for color by object class. For additional coloring, use the name of the object representation.
flags: The additional flags.
basePointGuid: Base point guid, if a base point used.
Returns: True, if Ifc4 export was successful, otherwise false. See session log for additional info in case failure.

Tekla.Structures.Model.Operations.Operation.ValidateIfc4ExportInputParameters(System.String,Tekla.Structures.Model.Operations.Operation.IFCExportViewTypeEnum,System.Collections.Generic.IEnumerable{System.String},Tekla.Structures.Model.Operations.Operation.ExportBasePoint,System.String,System.String,Tekla.Structures.Model.Operations.Operation.IFCExportFlags,System.String)
Validates the Ifc4 export input parameters.
fullPathAndFileName: The full path and file name including extension (.ifc or .ifcZip).
exportViewType: The export view type.
propertySets: The full path and file name of the property set files (.xml) to use in export.
locationByValue: The location by value.
exportLayersAsValue: The export layers as value: __Name__, __Phase__ or UDA value.
objectColoring: The object coloring value: Use "ByObjectClass" for color by object class. For additional coloring, use the name of the object representation.
flags: The additional flags.
basePointGuid: Base point guid, if a base point used.
Returns: True, if input parameters are validated successfully.

Tekla.Structures.Model.Operations.Operation.DoCreateIFC4ExportFromSelected(System.String,Tekla.Structures.Model.Operations.Operation.IFCExportViewTypeEnum,Tekla.Structures.Model.Operations.Operation.IFCExportVersionEnum,System.Collections.Generic.IEnumerable{System.String},System.Collections.Generic.IEnumerable{System.String},Tekla.Structures.Model.Operations.Operation.ExportBasePoint,System.String,System.String,Tekla.Structures.Model.Operations.Operation.IFCExportFlags,System.String,Tekla.Structures.ModelInternal.Operation.IfcExportType)
Creates IFC4 export from the selected parts using the given file name.
See Tekla Structures Help for more information about IFC4 export files.
fullPathAndFileName: The full path and file name including extension (.ifc or .ifcZip).
exportViewType: The export view type.
exportVersion: The IFC export version.
attributesOverridesFileNames: The collection of full paths and file names of the attributes overrides files (*_overrideSetData.attributeoverride and *_overrideData.attributeoverride) to use in export. Empty for none.
propertySets: The full path and file name of the property set files (.xml) to use in export.
locationByValue: The location by value.
exportLayersAsValue: The export layers as value: __Name__, __Phase__ or UDA value.
objectColoring: The object coloring value: Use "ByObjectClass" for color by object class. For additional coloring, use the name of the object representation.
flags: The additional flags.
basePointGuid: Base point guid, if a base point used.
exportType: The type of export.
Returns: True, if Ifc4 export was successful, otherwise false. See session log for additional info in case failure.

Tekla.Structures.Model.Operations.Operation.CreateDGNv8Export(System.String,System.String,Tekla.Structures.Model.Operations.Operation.ExportBasePoint,System.String,System.String,System.String,System.Boolean)
Dgn export from all or selected objects.
FileName:  The file name.
Folder:  The folder.
BasePoint: Defines which base point is used in export.
BasePointGuid: Base point guid if BasePoint parameter is set to BASE_POINT.
ObjectColoring: Defines which object coloring filter is to be used in export.
ExportLayersAs: Defines which report field to use for layers export.
OnlyFromSelectedObjects: Defines if only selected (value true) or all (value false) objects are exported.
Returns: True, if Dgn export was successful, otherwise false.

Tekla.Structures.Model.Operations.Operation.RunMacro(System.String)
Starts a macro with the given name. Throws an exception if the file is not found.
Macros are saved as *.cs files in the folder defined with the
XS_MACRO_DIRECTORY variable.
It is possible to run drawing macros using relative paths.
See Tekla Structures Help for more information about macros.
FileName: The name of the macro to start.
Returns: True if the macro existed.
using Tekla.Structures.Model.Operations;
public class Example
{
public void Example1()
{
Operation.RunMacro("MyModelingMacro.cs");
Operation.RunMacro(@"..\drawings\MyDrawingMacro.cs");
}
}

Tekla.Structures.Model.Operations.Operation.IsMacroRunning
Returns true if a macro is running, false otherwise.
Macros are saved as *.cs files in the folder defined with the
XS_MACRO_DIRECTORY variable.
See Tekla Structures Help for more information about macros.
Returns: True if a macro is running.

Tekla.Structures.Model.Operations.Operation.Open(System.String)
Opens a new model to Tekla Structures ignoring auto saved information.
ModelFolder: The model folder to be used.
Returns: True on success.

Tekla.Structures.Model.Operations.Operation.Open(System.String,System.Boolean)
Opens a new model to Tekla Structures.
ModelFolder: The model folder to be used.
OpenAutoSaved: Tells whether to open auto saved information or not.
Returns: True on success.

Tekla.Structures.Model.Operations.Operation.IsModelAutoSaved(System.String)
Tells whether a model has auto saved information.
ModelFolder: The model folder to be used.
Returns: True if there is auto saved information.

Tekla.Structures.Model.Operations.Operation.SaveAsWebModel(System.String)
Saves the current model as a web model.
You can save the model as a web model that can be viewed
via the Internet using a web browser (e.g. Internet Explorer).
Filename: The filename to be used.
Returns: True on success, false on failure.

Tekla.Structures.Model.Operations.Operation.SaveSelectedAsWebModel(System.String)
Saves the selected objects as a web model.
You can save the selected objects as a web model that can be viewed
via the Internet using a web browser (e.g. Internet Explorer).
Filename: The filename to be used.
Returns: True on success, false on failure.

Tekla.Structures.Model.Operations.Operation.ConvertPartToItem(Tekla.Structures.Model.Part@,Tekla.Structures.Model.Brep@)
Convert a part to an item. This will also create a new shape in the shape catalog.
originalPart: Original part
newItem: Newly created item
Returns: True on success, false on failure.
Throws System.ArgumentNullException: Thrown if the originalPart is null.

Tekla.Structures.Model.Operations.Operation.CreateShapeFromGeometry(Tekla.Structures.Model.Part)
Create a new shape in the shape catalog, based on the part geometry.
originalPart: Original part
Returns: The newly created shape name, or empty string on failure
Throws System.ArgumentNullException: Thrown if the originalPart is null.

Tekla.Structures.Model.Operations.Operation.MoveObject(Tekla.Structures.Model.ModelObject,Tekla.Structures.Geometry3d.Vector)
Moves the model object using the given translation vector.
Remarks:
Note that the object is moved and updated in the view so ModelObject.Modify() is not needed.
Call Modify() only after the object's data has been updated with the ModelObject.Select() method.
Object: The model object to move.
TranslationVector: The vector for moving the object.
Returns: True on success, false on failure.
In the following example a connection to the Tekla Structures model has already been established.
The example code creates a beam to the model and moves the beam one meter in the x and y directions.
using Tekla.Structures.Model;
using Tekla.Structures.Model.Operations;
using Tekla.Structures.Geometry3d;
using System.Windows.Forms;
public class Example
{
public void Example1()
{
Beam Beam1 = new Beam(new Point(0, 0, 0), new Point(3000, 0, 0));
Beam1.Profile.ProfileString = "PL10*140";
if(Beam1.Insert())
{
Vector Vector1 = new Vector(1000, 1000, 0);
if(Operation.MoveObject(Beam1, Vector1))
MessageBox.Show("Move succeeded");
}
}
}

Tekla.Structures.Model.Operations.Operation.MoveObject(Tekla.Structures.Model.ModelObject,Tekla.Structures.Geometry3d.CoordinateSystem,Tekla.Structures.Geometry3d.CoordinateSystem)
Moves the model object between the given translation coordinate systems.
Remarks:
Note that the object is moved and updated in the view so ModelObject.Modify() is not needed.
Call Modify() only after the object's data has been updated with the ModelObject.Select() method.
Object: The model object to move.
StartCoordinateSystem: The coordinate system to move the object from.
EndCoordinateSystem: The coordinate system to move the object to.
Returns: True on success, false on failure.
In the following example a connection to the Tekla Structures model has already been established.
The example code creates a beam (Beam3) to the model and moves the beam between the coordinate systems of Beam1 and Beam2.
using Tekla.Structures.Model;
using Tekla.Structures.Model.Operations;
using Tekla.Structures.Geometry3d;
using System.Windows.Forms;
public class Example
{
public void Example1()
{
Beam Beam1 = new Beam(new Point(0, 0, 0), new Point(3000, 0, 0));
Beam1.Profile.ProfileString = "PL10*140";
Beam1.Insert();
Beam Beam2 = new Beam(new Point(3000, 0, 0), new Point(6000, 0, 0));
Beam2.Profile.ProfileString = "PL10*140";
Beam2.Insert();
Beam Beam3 = new Beam(new Point(100, 0, 0), new Point(100, 0, 400));
Beam3.Profile.ProfileString = "PL10*140";
Beam3.Insert();
if(Operation.MoveObject(Beam3, Beam1.GetCoordinateSystem(), Beam2.GetCoordinateSystem()))
MessageBox.Show("Move succeeded");
}
}

Tekla.Structures.Model.Operations.Operation.MoveObjectMirror(Tekla.Structures.Model.ModelObject,System.Double,System.Double,System.Double)
Mirrors the object in the plane defined by the given data is the current workplane.
modelObject: The model object to mirror.
x: The x coordinate of a point on the mirror line.
y: The y coordinate of a point on the mirror line.
angle: The angle of the mirror line in radians to the x axis.
Returns: True if successful.
In the following example a connection to the Tekla Structures model has already been established.
The example code creates a beam (Beam1) to the model and moves the beam mirroring in the plane y=x.
using Tekla.Structures.Model;
using Tekla.Structures.Model.Operations;
using Tekla.Structures.Geometry3d;
using System.Windows.Forms;
public class Example
{
public void Example1()
{
Beam Beam1 = new Beam(new Point(0, 0, 0), new Point(3000, 0, 0));
Beam1.Profile.ProfileString = "PL10*140";
Beam1.Insert();
if(Operation.MoveObjectMirror(Beam1, 0.0, 0.0, Math.PI / 4.0))
MessageBox.Show("Move succeeded");
}
}

Tekla.Structures.Model.Operations.Operation.CopyObject(Tekla.Structures.Model.ModelObject,Tekla.Structures.Geometry3d.Vector)
Copies the model object using the given translation vector.
Object: The model object to copy.
CopyVector: The translation vector for copying.
Returns: The copied model object on success, null on failure.
In the following example a connection to the Tekla Structures model has already been established.
The example code creates a beam to the model and copies the beam to a location that is one meter in the x and y directions.
using Tekla.Structures.Model;
using Tekla.Structures.Model.Operations;
using Tekla.Structures.Geometry3d;
using System.Windows.Forms;
public class Example
{
public void Example1()
{
Beam Beam1 = new Beam(new Point(0, 0, 0), new Point(3000, 0, 0));
Vector Vector1 = new Vector(1000, 1000, 0);
Beam1.Profile.ProfileString = "PL10*140";
if(Beam1.Insert())
{
Beam Beam2 = Operation.CopyObject(Beam1, Vector1) as Beam;
if(Beam2 != null)
MessageBox.Show("Copy succeeded");
}
}
}

Tekla.Structures.Model.Operations.Operation.CopyObject(Tekla.Structures.Model.ModelObject,Tekla.Structures.Geometry3d.CoordinateSystem,Tekla.Structures.Geometry3d.CoordinateSystem)
Copies the model object between the given translation coordinate systems.
Object: The model object to copy.
StartCoordinateSystem: The coordinate system to copy the object from.
EndCoordinateSystem: The coordinate system to copy the object to.
Returns: The copied model object on success, null on failure.
In the following example a connection to the Tekla Structures model has already been established.
The example code creates a beam (Beam3) to the model and copies the beam between the coordinate systems of Beam1 and Beam2.
using Tekla.Structures.Model;
using Tekla.Structures.Model.Operations;
using Tekla.Structures.Geometry3d;
using System.Windows.Forms;
public class Example
{
public void Example1()
{
Beam Beam1 = new Beam(new Point(0, 0, 0), new Point(3000, 0, 0));
Beam1.Profile.ProfileString = "PL10*140";
Beam1.Insert();
Beam Beam2 = new Beam(new Point(3000, 0, 0), new Point(6000, 0, 0));
Beam2.Profile.ProfileString = "PL10*140";
Beam2.Insert();
Beam Beam3 = new Beam(new Point(100, 0, 0), new Point(100, 0, 400));
Beam3.Profile.ProfileString = "PL10*140";
Beam3.Insert();
Beam Beam4 = Operation.CopyObject(Beam3, Beam1.GetCoordinateSystem(), Beam2.GetCoordinateSystem()) as Beam;
if(Beam4 != null)
MessageBox.Show("Copy succeeded");
}
}

Tekla.Structures.Model.Operations.Operation.CopyObjectMirror(Tekla.Structures.Model.ModelObject,System.Double,System.Double,System.Double)
Creates a mirrored copy of the given model object.
modelObject: The model object to copy.
x: The x coordinate of a point on the mirror line.
y: The y coordinate of a point on the mirror line.
angle: The angle of the mirror line in radians to the x axis.
Returns: The copied model object if successful.
In the following example a connection to the Tekla Structures model has already been established.
The example code creates a beam to the model and copies the beam mirroring in the plane y = x.
using Tekla.Structures.Model;
using Tekla.Structures.Model.Operations;
using Tekla.Structures.Geometry3d;
using System.Windows.Forms;
public class Example
{
public void Example1()
{
Beam Beam1 = new Beam(new Point(0, 0, 0), new Point(3000, 0, 0));
Beam1.Profile.ProfileString = "PL10*140";
if(Beam1.Insert())
{
Beam Beam2 = Operation.CopyObjectMirror(Beam1, 10000.0, 0.0, Math.PI / 2.0) as Beam;
if(Beam2 != null)
MessageBox.Show("Copy succeeded");
}
}
}

Tekla.Structures.Model.Operations.Operation.Combine(Tekla.Structures.Model.Beam,Tekla.Structures.Model.Beam)
Combines two beams into one beam.
ObjectToCombineTo: The beam to be combined to.
ObjectToBeCombined: The beam which will be deleted after a successful operation.
Returns: The combined beam on success, null on failure.

Tekla.Structures.Model.Operations.Operation.Combine(Tekla.Structures.Model.SingleRebar,Tekla.Structures.Model.SingleRebar)
Combines two single rebars into one rebar.
ObjectToCombineTo: The rebar to be combined to.
ObjectToBeCombined: The rebar which will be deleted after a successful operation.
Returns: The combined single rebar on success, null on failure.

Tekla.Structures.Model.Operations.Operation.Combine(Tekla.Structures.Model.RebarGroup,Tekla.Structures.Model.RebarGroup)
Combines two rebar groups into one rebar group.
ObjectToCombineTo: The rebar group to be combined to.
ObjectToBeCombined: The rebar group which will be deleted after a successful operation.
Returns: The combined rebar group on success, null on failure.

Tekla.Structures.Model.Operations.Operation.Freeze(Tekla.Structures.Model.RebarSet,System.Boolean)
Freezes or unfreezes a rebar set.
rebarSet: The rebar set to be frozen or unfrozen.
value: True if it is to be frozen, false if it is to be unfrozen.
Returns: True if the frozen state has been successfully changed.

Tekla.Structures.Model.Operations.Operation.Split(Tekla.Structures.Model.Beam,Tekla.Structures.Geometry3d.Point)
Splits the beam and creates a new one in the given position.
Object: The beam object to be split.
SplitPoint: The position where splitting is executed.
Returns: The created beam on success, null on failure.

Tekla.Structures.Model.Operations.Operation.Split(Tekla.Structures.Model.PolyBeam,Tekla.Structures.Geometry3d.Point)
Splits the polybeam and creates a new one in the given position.
Object: The beam object to be split.
SplitPoint: The position where splitting is executed.
Returns: The created polybeam on success, null on failure.

Tekla.Structures.Model.Operations.Operation.Split(Tekla.Structures.Model.LoftedPlate,Tekla.Structures.Geometry3d.Point)
Splits the lofted plate and creates a new one in the given position.
Object: The lofted plate to be split.
SplitPoint: The position where splitting is executed.
Returns: The created lofted plate on success, null on failure.

Tekla.Structures.Model.Operations.Operation.SplitPartWithOnePoint``1(``0,Tekla.Structures.Geometry3d.Point)
Splits part with one point and creates a new one in the given position.
Object: The object like beam to be split.
SplitPoint: The position where splitting is executed.
Returns: The created part on success, null on failure.

Tekla.Structures.Model.Operations.Operation.Split(Tekla.Structures.Model.SingleRebar,Tekla.Structures.Geometry3d.Line)
Splits the single rebar and creates a new one in the given position.
Object: The single rebar object to be splitted.
SplitLine: The line where splitting is executed.
Returns: The created single rebar on success, null on failure.

Tekla.Structures.Model.Operations.Operation.Split(Tekla.Structures.Model.CurvedRebarGroup,Tekla.Structures.Geometry3d.Line)
Splits the curved rebar group and creates a new one in the given position.
Object: The curved rebar group object to be splitted.
SplitLine: The line where splitting is executed.
Returns: The created curved rebar group on success, null on failure.

Tekla.Structures.Model.Operations.Operation.Split(Tekla.Structures.Model.CircleRebarGroup,Tekla.Structures.Geometry3d.Line)
Splits the circle rebar group and creates a new one in the given position.
Object: The circle rebar group object to be splitted.
SplitLine: The line where splitting is executed.
Returns: The created circle rebar group on success, null on failure.

Tekla.Structures.Model.Operations.Operation.Split(Tekla.Structures.Model.RebarGroup,Tekla.Structures.Geometry3d.Line)
Splits the rebar group and creates a new one in the given position.
Object: The rebar group object to be splitted.
SplitLine: The line where splitting is executed.
Returns: The created rebar group on success, null on failure.

Tekla.Structures.Model.Operations.Operation.Split(Tekla.Structures.Model.RebarSet,Tekla.Structures.Geometry3d.Line)
Splits the rebar set and creates a new one in the given position.
Object: The rebar set object to be split.
SplitLine: The line where splitting is executed.
Returns: The created rebar set on success, null on failure.

Tekla.Structures.Model.Operations.Operation.Split(Tekla.Structures.Model.ContourPlate,Tekla.Structures.Model.Polygon)
Splits the contour plate and creates a new one along the given polygon.
Object: The contour plate object to be splitted.
SplitPolygon: The position where splitting is executed.
Returns: The created contour plate on success, null on failure.

Tekla.Structures.Model.Operations.Operation.SplitSlab(System.Int32,Tekla.Structures.Geometry3d.FacetedBrep)
This command is meant for specifically splitting a concrete slab with
advanced solid operations to create more robust and user friendly results
than the command:
public static ContourPlate Split(ContourPlate Object, Polygon SplitPolygon).
No validation is done for the type, it is the caller's responsibility to call
this only for valid types (slabs). Behavior for non-slabs is undetermined.
PartId: The part ID that identifies the slab to be split
Polymesh: The polymesh that defines the splitting surface
Returns: True on success.

Tekla.Structures.Model.Operations.Operation.Ungrouping(Tekla.Structures.Model.RebarGroup)
Ungroups the rebar group and creates new single rebars.
Reinforcement: The rebar group to be ungrouped.
Returns: An enumerator of single rebars.

Tekla.Structures.Model.Operations.Operation.Ungrouping(Tekla.Structures.Model.RebarMesh)
Ungroups the rebar mesh and creates new single rebars.
Reinforcement: The rebar mesh to be ungrouped.
Returns: An enumerator of single rebars.

Tekla.Structures.Model.Operations.Operation.Group(System.Collections.IEnumerable)
Groups a list of single rebars or rebar groups and creates a new rebar group.
RebarList: The list of single rebars and rebar groups to be grouped.
Returns: The created rebar group on success, null on failure.

Tekla.Structures.Model.Operations.Operation.ShowOnlySelected(Tekla.Structures.Model.Operations.Operation.UnselectedModeEnum)
Show Only Selected objects in current view.
UnselectedMode: Specify what to do with unselected parts.

Tekla.Structures.Model.Operations.Operation.FaceVerticesToPolygon(Tekla.Structures.ModelInternal.dotPolygon_t@,System.Collections.Generic.IList{Tekla.Structures.Geometry3d.Point})
Converts face vertices into a polygon for passing them to the TS core
facePolygon: Outputs an ordered polygon determining the face corner points
currentLoopPoints: The face loop points

Tekla.Structures.Model.Operations.Operation.SolidFaceToPointList(Tekla.Structures.Solid.Face)
Gets list of vertex points inside a solid face.
solidFace: Solid face to get points from.
Returns: Returns list of vertexes inside a solid face.

Tekla.Structures.Model.Operations.Operation.CreateBentPlateByParts(Tekla.Structures.Model.Part,Tekla.Structures.Model.Part,Tekla.Structures.Model.BentPlate.BendShape)
Modifies the first plate by adding a bend that connects it to the second plate
creating a new Tekla.Structures.Model.BentPlate instance based on two parts.
This method can change GUID when using from plug-ins.
To keep GUID, use Tekla.Structures.Model.BentPlateGeometrySolver.AddLeg(Tekla.Structures.Model.ConnectiveGeometry,Tekla.Structures.Model.ConnectiveGeometry,Tekla.Structures.Model.BentPlate.BendShape).
part1: One part used for creating the bent plate.
part2: The other part used for creating the bent plate.
bendShape: Shape of the bend (cylindrical or conical)
Throws Tekla.Structures.Model.ConnectiveGeometryException: Thrown if could not create ConnectiveGeometry instance.
Throws System.ArgumentException: Thrown if received unsupported bent plate creation input.
Returns: The bent plate object if successful, null otherwise.

Tekla.Structures.Model.Operations.Operation.CreateBentPlateByParts(Tekla.Structures.Model.Part,Tekla.Structures.Model.Part)
Modifies the first plate by adding a cylindrical bend that connects it to the second plate
creating a new Tekla.Structures.Model.BentPlate instance based on two parts.
See Tekla.Structures.Model.Operations.Operation.CreateBentPlateByParts(Tekla.Structures.Model.Part,Tekla.Structures.Model.Part,Tekla.Structures.Model.BentPlate.BendShape).
part1: One part used for creating the bent plate.
part2: The other part used for creating the bent plate.
Returns: The bent plate object if successful, null otherwise.

Tekla.Structures.Model.Operations.Operation.CreateBentPlateByParts(Tekla.Structures.Model.Part,Tekla.Structures.Model.Part,System.Double)
Modifies the first plate by adding a bend that connects it to the second plate
creating a new Tekla.Structures.Model.BentPlate instance based on two parts and a radius.
This method can change GUID when using from plug-ins.
To keep GUID, use Tekla.Structures.Model.BentPlateGeometrySolver.AddLeg(Tekla.Structures.Model.ConnectiveGeometry,Tekla.Structures.Model.ConnectiveGeometry,System.Double).
part1: One part used for creating the bent plate.
part2: The other part used for creating the bent plate.
radius: The target radius for the created cylindrical section.
Throws Tekla.Structures.Model.ConnectiveGeometryException: Thrown if could not create ConnectiveGeometry instance.
Throws System.ArgumentException: Thrown if received unsupported bent plate creation input.
Returns: The bent plate object if successful, null otherwise

Tekla.Structures.Model.Operations.Operation.CreateConicalBentPlateByPartsAndAperture(Tekla.Structures.Model.Part,Tekla.Structures.Model.Part,System.Double,System.Double)
Modifies the first plate by adding a conical bend that connects it to the second plate
creating a new Tekla.Structures.Model.BentPlate instance based on two parts. The resulting bend
will have the given aperture and the provided larger radius.
part1: One part used for creating the bent plate.
part2: The other part used for creating the bent plate.
largestRadius: Radius of the largest section of the cone
halfAperture: Angle between a generatrix of the cone and its center line (i.e. axis)
Returns: The bent plate object if successful, null otherwise

Tekla.Structures.Model.Operations.Operation.CreateConicalBentPlateByPartsAndTwoRadiuses(Tekla.Structures.Model.Part,Tekla.Structures.Model.Part,System.Double,System.Double)
Modifies the first plate by adding a conical bend that connects it to the second plate
creating a new Tekla.Structures.Model.BentPlate instance based on two parts. The resulting bend
will have the two given radiuses.
part1: One part used for creating the bent plate.
part2: The other part used for creating the bent plate.
firstRadius: Radius of one section of the cone
secondRadius: Radius of the other section of the cone
Returns: The bent plate object if successful, null otherwise

Tekla.Structures.Model.Operations.Operation.CreateBentPlateByFaces(Tekla.Structures.Model.Part,System.Collections.Generic.IList{Tekla.Structures.Geometry3d.Point},Tekla.Structures.Model.Part,System.Collections.Generic.IList{Tekla.Structures.Geometry3d.Point},Tekla.Structures.Model.BentPlate.BendShape)
Modifies the first plate by adding a bend that connects it to the second plate
creating a new Tekla.Structures.Model.BentPlate instance based on two parts and selected faces in each part.
This method can change GUID when using from plug-ins.
To keep GUID, use Tekla.Structures.Model.BentPlateGeometrySolver.AddLeg(Tekla.Structures.Model.ConnectiveGeometry,Tekla.Structures.Geometry3d.LineSegment,Tekla.Structures.Model.ConnectiveGeometry,Tekla.Structures.Geometry3d.LineSegment,Tekla.Structures.Model.BentPlate.BendShape).
part1: The first part.
face1: The selected face on the first part.
part2: The second part.
face2: The selected face on the second part.
bendShape: Shape of the bend (cylindrical or conical)
Throws Tekla.Structures.Model.ConnectiveGeometryException: Thrown if could not create ConnectiveGeometry instance.
Throws System.ArgumentException: Thrown when faces have incorrect number of face points or received unsupported bent plate creation input.
Returns: The bent plate object if successful, null otherwise.

Tekla.Structures.Model.Operations.Operation.CreateBentPlateByFaces(Tekla.Structures.Model.Part,System.Collections.Generic.IList{Tekla.Structures.Geometry3d.Point},Tekla.Structures.Model.Part,System.Collections.Generic.IList{Tekla.Structures.Geometry3d.Point})
Modifies the first plate by adding a cylindrical bend that connects it to the second plate
creating a new Tekla.Structures.Model.BentPlate instance based on two parts and selected faces in each part.
See Tekla.Structures.Model.Operations.Operation.CreateBentPlateByFaces(Tekla.Structures.Model.Part,System.Collections.Generic.IList{Tekla.Structures.Geometry3d.Point},Tekla.Structures.Model.Part,System.Collections.Generic.IList{Tekla.Structures.Geometry3d.Point},Tekla.Structures.Model.BentPlate.BendShape).
part1: The first part.
face1: The selected face on the first part.
part2: The second part.
face2: The selected face on the second part.
Returns: The bent plate object if successful, null otherwise.

Tekla.Structures.Model.Operations.Operation.CreateBentPlateByFaces(Tekla.Structures.Model.Part,Tekla.Structures.Solid.Face,Tekla.Structures.Model.Part,Tekla.Structures.Solid.Face,Tekla.Structures.Model.BentPlate.BendShape)
Modifies the first plate by adding a bend that connects it to the second plate
creating a new Tekla.Structures.Model.BentPlate instance based on two parts and selected faces in each part.
This method can change GUID when using from plug-ins.
To keep GUID, use Tekla.Structures.Model.BentPlateGeometrySolver.AddLeg(Tekla.Structures.Model.ConnectiveGeometry,Tekla.Structures.Geometry3d.LineSegment,Tekla.Structures.Model.ConnectiveGeometry,Tekla.Structures.Geometry3d.LineSegment,Tekla.Structures.Model.BentPlate.BendShape).
part1: The first part.
face1: The selected solid face on the first part.
part2: The second part.
face2: The selected solid face on the second part.
bendShape: Shape of the bend (cylindrical or conical)
Throws Tekla.Structures.Model.ConnectiveGeometryException: Thrown if could not create ConnectiveGeometry instance.
Throws System.ArgumentException: Thrown when faces have incorrect number of face points or received unsupported bent plate creation input.
Returns: The bent plate object if successful, null otherwise.

Tekla.Structures.Model.Operations.Operation.CreateBentPlateByFaces(Tekla.Structures.Model.Part,Tekla.Structures.Solid.Face,Tekla.Structures.Model.Part,Tekla.Structures.Solid.Face)
Modifies the first plate by adding a cylindrical bend that connects it to the second plate
creating a new Tekla.Structures.Model.BentPlate instance based on two parts and selected faces in each part.
See Tekla.Structures.Model.Operations.Operation.CreateBentPlateByFaces(Tekla.Structures.Model.Part,Tekla.Structures.Solid.Face,Tekla.Structures.Model.Part,Tekla.Structures.Solid.Face,Tekla.Structures.Model.BentPlate.BendShape).
part1: The first part.
face1: The selected face on the first part.
part2: The second part.
face2: The selected face on the second part.
Returns: The bent plate object if successful, null otherwise.

Tekla.Structures.Model.Operations.Operation.CreateBentPlateByFaces(Tekla.Structures.Model.Part,System.Collections.Generic.IList{Tekla.Structures.Geometry3d.Point},Tekla.Structures.Model.Part,System.Collections.Generic.IList{Tekla.Structures.Geometry3d.Point},System.Double)
Modifies the first plate by adding a bend that connects it to the second plate
creating a new Tekla.Structures.Model.BentPlate instance based on two parts, selected faces in each part and radius.
This method can change GUID when using from plug-ins.
To keep GUID, use Tekla.Structures.Model.BentPlateGeometrySolver.AddLeg(Tekla.Structures.Model.ConnectiveGeometry,Tekla.Structures.Geometry3d.LineSegment,Tekla.Structures.Model.ConnectiveGeometry,Tekla.Structures.Geometry3d.LineSegment,System.Double).
part1: The first part.
face1: The selected face on the first part.
part2: The second part.
face2: The selected face on the second part.
radius: The target radius for the created cylindrical section.
Throws Tekla.Structures.Model.ConnectiveGeometryException: Thrown if could not create ConnectiveGeometry instance.
Throws System.ArgumentException: Thrown when faces have incorrect number of face points or received unsupported bent plate creation input.
Returns: The bent plate object if successful, null otherwise.

Tekla.Structures.Model.Operations.Operation.CreateBentPlateByFaces(Tekla.Structures.Model.Part,Tekla.Structures.Solid.Face,Tekla.Structures.Model.Part,Tekla.Structures.Solid.Face,System.Double)
Modifies the first plate by adding a bend that connects it to the second plate
creating a new Tekla.Structures.Model.BentPlate instance based on two parts and selected faces in each part and radius.
This method can change GUID when using from plug-ins.
To keep GUID, use Tekla.Structures.Model.BentPlateGeometrySolver.AddLeg(Tekla.Structures.Model.ConnectiveGeometry,Tekla.Structures.Geometry3d.LineSegment,Tekla.Structures.Model.ConnectiveGeometry,Tekla.Structures.Geometry3d.LineSegment,System.Double).
part1: The first part.
face1: The selected solid face on the first part.
part2: The second part.
face2: The selected solid face on the second part.
radius: The target radius for the created cylindrical section.
Throws Tekla.Structures.Model.ConnectiveGeometryException: Thrown if could not create ConnectiveGeometry instance.
Throws System.ArgumentException: Thrown when faces have incorrect number of face points or received unsupported bent plate creation input.
Returns: The bent plate object if successful, null otherwise.

Tekla.Structures.Model.Operations.Operation.CreateConicalBentPlateByFaces(Tekla.Structures.Model.Part,System.Collections.Generic.IList{Tekla.Structures.Geometry3d.Point},Tekla.Structures.Model.Part,System.Collections.Generic.IList{Tekla.Structures.Geometry3d.Point},System.Double,System.Double)
Modifies the first plate by adding a conical bend that connects it to the second plate
creating a new Tekla.Structures.Model.BentPlate instance based on two parts, selected faces in each part and radius.
This method can change GUID when using from plug-ins.
To keep GUID, use Tekla.Structures.Model.BentPlateGeometrySolver.AddLeg(Tekla.Structures.Model.ConnectiveGeometry,Tekla.Structures.Geometry3d.LineSegment,Tekla.Structures.Model.ConnectiveGeometry,Tekla.Structures.Geometry3d.LineSegment,System.Double).
part1: The first part.
face1: The selected face on the first part.
part2: The second part.
face2: The selected face on the second part.
largestRadius: The largest target radius for the created conical section.
halfAperture: Angle between a generatrix of the cone and its center line (i.e. axis)
Throws Tekla.Structures.Model.ConnectiveGeometryException: Thrown if could not create ConnectiveGeometry instance.
Throws System.ArgumentException: Thrown when faces have incorrect number of face points or received unsupported bent plate creation input.
Returns: The bent plate object if successful, null otherwise.

Tekla.Structures.Model.Operations.Operation.CreateConicalBentPlateByFaces(Tekla.Structures.Model.Part,Tekla.Structures.Solid.Face,Tekla.Structures.Model.Part,Tekla.Structures.Solid.Face,System.Double,System.Double)
Modifies the first plate by adding a conical bend that connects it to the second plate
creating a new Tekla.Structures.Model.BentPlate instance based on two parts and selected faces in each part, and the
largest radius of the conical section and the cone aperture.
This method can change GUID when using from plug-ins.
To keep GUID, use Tekla.Structures.Model.BentPlateGeometrySolver.AddLeg(Tekla.Structures.Model.ConnectiveGeometry,Tekla.Structures.Geometry3d.LineSegment,Tekla.Structures.Model.ConnectiveGeometry,Tekla.Structures.Geometry3d.LineSegment,System.Double).
part1: The first part.
face1: The selected solid face on the first part.
part2: The second part.
face2: The selected solid face on the second part.
largestRadius: Largest radius of the conical section
halfAperture: Angle between a generatrix of the cone and its center line (i.e. axis)
Throws Tekla.Structures.Model.ConnectiveGeometryException: Thrown if could not create ConnectiveGeometry instance.
Throws System.ArgumentException: Thrown when faces have incorrect number of face points or received unsupported bent plate creation input.
Returns: The bent plate object if successful, null otherwise.

Tekla.Structures.Model.Operations.Operation.ExplodeBentPlate(Tekla.Structures.Model.BentPlate)
Deletes bentPlate and inserts Tekla.Structures.Model.ContourPlates instances
equivalent to the ones used to create bentPlate.
The Tekla.Structures.Model.ContourPlate created from the main polygon has the same identifier as bentPlate.
bentPlate: the Tekla.Structures.Model.BentPlate instance to explode.
Throws System.ArgumentException: Thrown when bentPlate is invalid.
Returns: True on success.

Tekla.Structures.Model.Operations.Operation.AddToPourUnit(Tekla.Structures.Model.PourUnit,System.Collections.Generic.List{Tekla.Structures.Model.ModelObject})
Adds model objects as part of a pour unit
Model object types accepted are assembly types except cast in situ,
reinforcements of different kind, components and bolts
inputPourUnit: the instance of pour unit to add objects to.
objectsToBeAdded: the list of model objects to be added.
Throws System.ArgumentException: Throw exceptions if Pour or object has invalid ID,
do not exist in model or not valid object type.
Returns: True on success.
The following example shows how to add all rebar groups in a model to a pour unit defined by the pour GUID.
You will have to replace the curly braces for the List with lesser and greater than signs.
using System.Collections.Generic;
using Tekla.Structures.Model;
public class Example
{
public void ExampleAddAllRebarGroupsToPour(Guid pourUnitGuid)
{
var Model = new Model();
ModelObjectEnumerator PourEnumerator =
Model.GetModelObjectSelector().GetAllObjectsWithType(ModelObject.ModelObjectEnum.POUR_UNIT);
PourUnit pour = null;
if(PourEnumerator.GetSize() > 0)
{
while(PourEnumerator.MoveNext())
{
var curPour = PourEnumerator.Current as PourUnit;
if(curPour != null)
{
if(curPour.Identifier.GUID == pourUnitGuid)
{
pour = curPour;
break;
}
}
}
}
if(pour != null)
{
var rebarGroupList = new List{ModelObject}();
ModelObjectEnumerator ObjectEnumerator =
Model.GetModelObjectSelector().GetAllObjectsWithType(ModelObject.ModelObjectEnum.REBARGROUP);
if(ObjectEnumerator.GetSize() > 0)
{
while(ObjectEnumerator.MoveNext())
{
var rebargroup = ObjectEnumerator.Current as RebarGroup;
if(rebargroup != null)
{
rebarGroupList.Add(rebargroup);
}
}
}
if (rebarGroupList.Count() > 0)
{
try
{
AddToPourUnit(pour, rebarGroupList);
}
catch (ArgumentException ex)
{
var DoSomethingWithThisEx = ex;
}
}
}
}
}

Tekla.Structures.Model.Operations.Operation.RemoveFromPourUnit(System.Collections.Generic.List{Tekla.Structures.Model.ModelObject})
Removes model object from pour unit
Model object types accepted are assembly types except cast in situ,
reinforcements of different kind, components and bolts
objectsToBeRemoved: the list of model objects to be added.
Throws System.ArgumentException: Throw exceptions if object has invalid ID,
do not exist in model or not valid object type.
Returns: True on success.
The following example shows how to remove one rebar group from the pour unit.
You will have to replace the curly braces for the List with lesser and greater than signs.
using System.Collections.Generic;
using Tekla.Structures.Model;
using Tekla.Structures.Model.Operations;
public class Example
{
public void ExampleRemoveRebarGroupFromPour(Guid rebarGroupGuid)
{
var Model = new Model();
ModelObjectEnumerator ObjectEnumerator =
Model.GetModelObjectSelector().GetAllObjectsWithType(ModelObject.ModelObjectEnum.REBARGROUP);
RebarGroup rebarGroup = null;
bool bFound = false;
if(ObjectEnumerator.GetSize() > 0)
{
while(ObjectEnumerator.MoveNext())
{
rebarGroup = ObjectEnumerator.Current as RebarGroup;
if(rebarGroup != null)
{
if(rebarGroup.Identifier.GUID == rebarGroupGuid)
{
bFound = true;
break;
}
}
}
}
if(bFound)
{
var objectsToRemove = new List{ModelObject}() { rebarGroup };
RemoveFromPourUnit(objectsToRemove);
}
}
}

Tekla.Structures.Model.Operations.Operation.CalculatePourUnits
Calculate and assign objects to pour unit
Model object types that are associated with pour unit are assembly types except cast in situ,
reinforcements of different kind, components and screws
Returns: True on success.

Tekla.Structures.Model.Operations.Operation.GetHandlePoints(System.String)
Get the Shape Item Handle Points
guid: The guid of the shape
Returns: List of Handle Points

Tekla.Structures.Model.Operations.Operation.SetHandlePoints(System.String,System.Collections.Generic.List{Tekla.Structures.Geometry3d.Point})
Set the Shape Item Handle Points
guid: The guid of the shape
HandlePoints: An array of handle points
Returns: True if the appending operation was successful

Tekla.Structures.Model.Operations.Operation.Highlight(System.Collections.Generic.List{Tekla.Structures.Model.ModelObject})
Highlight the list of objects from the user interface.
Only the list of objects will be highlighted, the rest will be unhighlighted. But it will keep the status of the selected objects.
To unhighlight give an empty list as a parameter.
ModelObjects: The list of model objects to highlight.
Returns: True on success.

Tekla.Structures.Model.Operations.Operation.DisplayPrompt(System.String)
Displays a message in the status bar.
Remarks:
Prompts
Tekla Structures prefixes the given prompt with "prompt_" and
looks for a translation in the prompts.ail file. If the translation
(e.g. "prompt_Pick_first_position") is not found in the prompts.ail
file, the prompt string is displayed as such. This feature can be used to
give already translated strings to the picker.
Message: The message to display.
Throws System.ArgumentNullException: Thrown when the Message is null.
Returns: True if the message could be displayed.

Tekla.Structures.Model.Operations.Operation.ObjectMatchesToFilter(Tekla.Structures.Model.ModelObject,System.String)
Checks whether the object matches to the criteria in the given filter.
ModelObject: The model object to check.
FilterName: The filter file to check against.
Throws System.ArgumentException: Thrown when the ModelObject is not valid.
Returns: True if the object matches to the given filter criteria.

Tekla.Structures.Model.Operations.Operation.ObjectMatchesToFilter(Tekla.Structures.Model.ModelObject,Tekla.Structures.Filtering.FilterExpression)
Checks whether the object matches to the criteria in the given filter.
ModelObject: The model object to check.
FilterExpression: The definition of a selection filter to check against.
Throws System.ArgumentException: Thrown when the ModelObject is not valid.
Returns: True if the object matches to the given filter criteria.
In the following example a connection to the Tekla Structures model has already been established.
The example code creates a beam to the model and moves the beam one meter in the x and y directions.
using Tekla.Structures.Model;
using Tekla.Structures.Model.Operations;
using Tekla.Structures.Filtering;
using Tekla.Structures.Filtering.Categories;
using Tekla.Structures.Geometry3d;
using System.Windows.Forms;
public class Example
{
public void Example1()
{
Beam Beam1 = new Beam(new Point(0, 0, 0), new Point(3000, 0, 0));
Beam1.Profile.ProfileString = "PL10*140";
Beam1.Name = "GetObjectsByFilter";
if(Beam1.Insert())
{
BinaryFilterExpression FilterExpression1 = new BinaryFilterExpression(new PartFilterExpressions.Name(),
StringOperatorType.IS_EQUAL,
new StringConstantFilterExpression("GetObjectsByFilter"));
if(Operation.ObjectMatchesToFilter(Beam1, FilterExpression1))
MessageBox.Show("Object matches the filter");
}
}
}